Identify the pane is currently visible or in a tab.
  Namespace:   Autodesk.Revit.UI
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public bool IsShown()
  Visual Basic
Public Function IsShown As Boolean
  Visual C++
public:
bool IsShown()
 See Also
  DockablePane Class
  Autodesk.Revit.UI Namespace